## **============= Project 3 - SQL tables in a pandas DataFrame ==========**

IS362 - Kelvin Rodriguez

### 1 - MySQL Version (Uses Localhost)

In [8]:
# Install the PyMySQL library (used to connect Python with MySQL)
!pip install pymysql

# Import required libraries
import pandas as pd 
from sqlalchemy import create_engine

# Create a connection to the MySQL Chinook database
# Format: "mysql+pymysql://<username>:<password>@<host>/<database>"
engine = create_engine("mysql+pymysql://root:Andrew1809@localhost/Chinook")

# Define SQL query to retrieve customer names, tracks, and album titles
query = """
SELECT
    c.LastName, -- Customer last name
    c.FirstName,-- Customer first name
    t.Name  AS TrackName, 
    a.Title AS AlbumTitle
FROM Customer AS c
JOIN Invoice       AS i  ON i.CustomerId = c.CustomerId -- Connect customers to invoices
JOIN InvoiceLine   AS il ON il.InvoiceId = i.InvoiceId -- Link invoice lines
JOIN Track         AS t  ON t.TrackId    = il.TrackId -- Match track info
JOIN Album         AS a  ON a.AlbumId    = t.AlbumId  -- Include album title
ORDER BY c.LastName, c.FirstName
LIMIT 5;
"""

# Execute the SQL query and load the results into a pandas DataFrame
df = pd.read_sql(query, engine)

# Display the first few rows of the DataFrame
df.head()

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.13/site-packages (1.1.2)

,LastName,FirstName,TrackName,AlbumTitle
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,Caso Você Queira Saber,Minas
2,Almeida,Roberto,In The Evening,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Fool In The Rain,In Through The Out Door

### 2 - SQLite Version (No Localhost Needed)

In [10]:
!pip install SQLAlchemy -q

# Import required libraries
import requests
import pandas as pd
from sqlalchemy import create_engine

# Download the Chinook SQLite database from GitHub
db_url = "https://github.com/lerocha/chinook-database/raw/master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite"
db_path = "Chinook.sqlite"

r = requests.get(db_url)
with open(db_path, "wb") as f:
    f.write(r.content)

# Create connection to SQLite database (no localhost needed)
engine = create_engine(f"sqlite:///{db_path}")

# Fetch your SQL query from GitHub
sql_url = "https://raw.githubusercontent.com/KingScanor/IS362-Project_3/main/Chinook_Query.sql"
query = requests.get(sql_url).text

# Execute query and load into DataFrame
with engine.connect() as conn:
    df = pd.read_sql_query(query, conn)

df.head()

,LastName,FirstName,TrackName,AlbumTitle
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

**References**

-SQLAlchemy website helped me understand better how to properly apply it. It is an excellent source.  
Engine Configuration — SQLAlchemy 2.0 documentation. (n.d.). https://docs.sqlalchemy.org/en/20/core/engines.html

-I learned on this website how to connect to the MySQL database remotely or locally using Python.
GeeksforGeeks. (2020, September 5). Connect to MySQL using PyMySQL in Python. GeeksforGeeks. https://www.geeksforgeeks.org/python/connect-to-mysql-using-pymysql-in-python/

-From this website I got the Chinook SQL that I downloaded to create the script. 
Lerocha. (n.d.). chinook-database/ChinookDatabase/DataSources/Chinook_MySql.sql at master · lerocha/chinook-database. GitHub. https://github.com/lerocha/chinook-database/blob/master/ChinookDatabase/DataSources/Chinook_MySql.sql

-I utilized this site to go over what I learned the previous semester.

W3Schools.com. (n.d.). https://www.w3schools.com/mysql/mysql_join.asp